Revit 2026 API

# DatumExtentType Enumeration

---

Represents the type of datum extent that is displayed in a particular view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DatumExtentType
```
```vb
Public Enumeration DatumExtentType
```
```cpp
public enum class DatumExtentType
```
```fsharp
type DatumExtentType
```

| Member name | Value | Description |
| --- | --- | --- |
| Model | 0 | The extent represents the actual 3D extent of the datum plane. |
| ViewSpecific | 1 | The extent displayed is specific to the view and does not represent the actual 3D extent of the datum plane. |

#### Reference

Autodesk.Revit.DB Namespace